alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"


def atbash_d(s):
	alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
	ans = ''
	for i in s.lower():
		if (i in alphabet):
			ans += alphabet[len(alphabet) - alphabet.index(i) - 1]
		else:
			ans += i
	return ans
	
def caesar(s, n):
	alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяабвгдеёжзийклмнопрстуфхцчшщъыьэюя"
	ans = ''
	for i in s.lower():
		if (i in alphabet):
			ans += alphabet[alphabet.index(i) + n]
		else:
			ans += i
	return ans
	
def monoalph(s):
	alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
	freq = 'оеаинтсрвлкмдпуяыьгзбчйхжшюцщэфъё'
	array = [0]*33
	for i in s:
		if (i in alphabet):
			array[alphabet.index(i)] += 1

	ans = ''
	for _ in range(len(array)):
		ans += alphabet[array.index(max(array))]
		array[array.index(max(array))] = -1
	ooo = ''
	for i in s.lower():
		if (i in alphabet):
			ooo += freq[ans.index(i)]
		else:
			ooo += i
	return ooo	
			
def f(s):
	alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
	d =  {"о": "в", "р": "г", "ц": "о", "м": "д", "т": "у", "й": "з", "н": "г", "щ": "е", "ю": "н", "ж": "р", "э": "а", "е": "ш", "г": "и", "п": "ф", "ч": "к", "я": "л", "б": "т", "с": "м", "ф": "ю", "а": "п"}
	ans = ''
	for i in s.lower():
 		if (i in alphabet and i in d):
 			ans += d[i]
 		else:
 			ans += i
	return ans
 			
text = "Егпж Огнщющжэ (ацягэяпэогбюцы йэсщюз)Мэяхющыегс ажцмцянщюгщс егпжцо ажцшбцы йэсщюз иояищбши сюцрцэяпэогбюзщ егпжз. Эьт Эях-Чгюмг о шоцгв жэьцбэв ацчэйэя, лбц цьзлюзщ сцюцэяпэогбюзщ егпжз мцоцяхюц-бэчг ажцшбц ацммэфбши лэшбцбюцст чжгабцэюэягйт г ащжозс ажщмяцнгя гшацяхйцоэбх сюцрцэяпэогбюзщ егпжз. О Щожцащ бэчгщ егпжз ьзяг оащжозщ цагшэюз о 1467 рцмт гбэяхиюшчгс эжвгбщчбцжцс Ящцю Ьэббгшбэ Эяхьщжбг. О XVI ощчщ ющсщёчгы эььэб Гцрэюю Бжгбщсгы о шоцщы чюгрщ “Шбщюцржэпги” ажщмшбэогя швщст ацягэяпэогбюцрц егпжцоэюги о огмщ бэьягёз. Ьцящщ шяцнюзы оэжгэюб ш гшацяхйцоэюгщс шсщеэююзв эяпэогбцо ьзя цагшэю о 1563 рцмт Мнэсьэббгшбэ мщяяэ Ацжбэ о щрц чюгрщ “Ажц шчжзбтф йюэлгсцшбх цбмщяхюзв ьтчо”. Ацшящмюгс шяцоцс о жэйогбгг ацягэяпэогбюзв егпжцо сцнюц шлгбэбх жцбцжюзщ сэегюз, ажгсщжцс чцбцжцы сцнюц шлгбэбх ющсщёчтф сэегют Enigma, жэйжэьцбэююэи о 1917 р. Штбх ацягэяпэогбюзв егпжцо йэчяфлщюэ о сюцрцчжэбюцс ажгсщющюгг жэйяглюзв егпжцо ажцшбцы йэсщюз ч цажщмщящююцст лгшят ьтчо егпжтщсцрц бщчшбэ. Бц щшбх ч чэнмцы ьтчощ ац цбмщяхюцшбг ажгсщюищбши цмгю гй егпжцо ажцшбцы йэсщюз.Егпж Огнщющжэ шцшбцгб гй ацшящмцоэбщяхюцшбг ющшчцяхчгв егпжцо Ёщйэжи ш жэйяглюзсг йюэлщюгисг шмогрэ. Мяи йэегпжцозоэюги сцнщб гшацяхйцоэбхши бэьягёэ эяпэогбцо, юэйзоэщсэи чоэмжэб (бэьягёэ) Огнщющжэ. Ажгсщюгбщяхюц ч жтшшчцст эяпэогбт бэьягёэ Огнщющжэ шцшбэояищбши гй шбжцч ац 33 шгсоцяцо, ажглдс чэнмэи шящмтфъэи шбжцчэ шмогрэщбши юэ ющшчцяхчц ацйгёгы. Бэчгс цьжэйцс, о бэьягёщ ацятлэщбши 33 жэйяглюзв егпжцо Ёщйэжи. Юэ жэйюзв кбэаэв чцмгжцочг егпж Огнщющжэ гшацяхйтщб жэйяглюзщ эяпэогбз гй кбцы бэьягёз. Юэ чэнмцс кбэащ егпжцоэюги гшацяхйтфбши жэйяглюзщ эяпэогбз, озьгжэщсзщ о йэогшгсцшбг цб шгсоцяэ чяфлщоцрц шяцоэ. Юэажгсщж, щшяг чяфлщоцщ шяцоц “ШЭБ”, бц ащжоэи ьтчоэ цбчжзбцрц бщчшбэ егпжтщбши ш гшацяхйцоэюгщс эяпэогбэ “Ш’, обцжэи “Э”, бжщбхи “Б”, лщбоджбэи шюцоэ “Ш” г бэч мэящщ.Ажцржэссэ егпжцоэюги егпжцс Огнщющжэ:"
	
print(f(text))
